[
  {
    "word": "friend",
    "syllables": [
      "friend"
    ],
    "pronunciation": "frend",
    "parts": [
      {
        "part": "noun",
        "variants": [
          {
            "part": "noun",
            "variant": "friend"
          },
          {
            "part": "plural noun",
            "variant": "friends"
          },
          {
            "part": "noun",
            "variant": "Friend"
          },
          {
            "part": "plural noun",
            "variant": "Friends"
          }
        ],
        "definitions": [
          {
            "definition": "a person whom one knows and with whom one has a bond of mutual affection, typically exclusive of sexual or family relations.",
            "examples": [
              "companion, soul mate, intimate, confidante, confidant, familiar, alter ego, second self, playmate, playfellow, classmate, schoolmate, workmate; Moreally, associate; sister, brother; best friend, kindred spirit, bosom buddy, bosom friend; informalpal, chum, sidekick, crony, main man, mate, buddy, bud, amigo, compadre, homeboy, homegirl, homie, dawg, gal pal, BF, BFF; informalpeeps; archaiccompeer \"a close friend\"Moreally, associate; sister, brother; best friend, kindred spirit, bosom buddy, bosom friend; pal, chum, sidekick, crony, main man, mate, buddy, bud, amigo, compadre, homeboy, homegirl, homie, dawg, gal pal, BF, BFF; peeps; compeer a close friend"
            ],
            "antonyms": [
              "enemy"
            ]
          },
          {
            "definition": "a person who acts as a supporter of a cause, organization, or country by giving financial or other help.",
            "examples": [
              "join the Friends of Guilford Free Library"
            ],
            "synonyms": [
              "patron",
              "backer",
              "supporter",
              "benefactor",
              "benefactress",
              "sponsor; Morewell-wisher",
              "defender",
              "champion; informalangel \"the friends of the National Ballet\""
            ]
          },
          {
            "definition": "a person who is not an enemy or who is on the same side.",
            "examples": [
              "she was unsure whether he was friend or foe"
            ]
          },
          {
            "definition": "a familiar or helpful thing.",
            "examples": [
              "he settled for that old friend the compensation grant"
            ]
          },
          {
            "definition": "(often as a polite form of address or in ironic reference) an acquaintance or a stranger one comes across.",
            "examples": [
              "my friends, let me introduce myself"
            ]
          },
          {
            "definition": "a contact associated with a social networking website.",
            "examples": [
              "all of a sudden you've got 50 friends online who need to stay connected"
            ]
          },
          {
            "definition": "a member of the Religious Society of Friends; a Quaker."
          }
        ]
      },
      {
        "part": "verb",
        "variants": [
          {
            "part": "verb",
            "variant": "friend"
          },
          {
            "part": "3rd person present",
            "variant": "friends"
          },
          {
            "part": "gerund or present participle",
            "variant": "friending"
          },
          {
            "part": "past tense",
            "variant": "friended"
          },
          {
            "part": "past participle",
            "variant": "friended"
          }
        ],
        "definitions": [
          {
            "definition": "add (someone) to a list of contacts associated with a social networking website.",
            "examples": [
              "I am friended by 29 people who I have not friended back"
            ]
          },
          {
            "definition": "befriend (someone)."
          }
        ]
      }
    ]
  }
]