[
  {
    "word": "present",
    "syllables": [
      "pre",
      "sent"
    ],
    "pronunciation": "prəˈzent",
    "parts": [
      {
        "part": "verb",
        "variants": [
          {
            "part": "gerund or present participle",
            "variant": "presenting"
          }
        ],
        "definitions": [
          {
            "definition": "give something to (someone) formally or ceremonially.",
            "examples": [
              "a top executive will present an award to employees who built the F-150"
            ],
            "synonyms": [
              "hand over/out",
              "give (out)",
              "confer",
              "bestow",
              "award",
              "grant",
              "accord \"the president presented a check to the winner\""
            ]
          },
          {
            "definition": "give someone (something) ceremonially.",
            "examples": [
              "my students presented me with some flowers"
            ]
          },
          {
            "definition": "show or offer (something) for others to scrutinize or consider.",
            "examples": [
              "he stopped and presented his passport"
            ],
            "synonyms": [
              "submit",
              "set forth",
              "put forward",
              "proffer",
              "offer",
              "tender",
              "table \"the committee presented its report\""
            ]
          },
          {
            "definition": "formally introduce (someone) to someone else.",
            "examples": [
              "may I present my wife?"
            ],
            "synonyms": [
              "introduce",
              "make known",
              "acquaint someone with \"may I present my wife?\""
            ]
          },
          {
            "definition": "proffer (compliments or good wishes) in a formal manner.",
            "examples": [
              "may I present the greetings of my master?"
            ],
            "synonyms": [
              "offer",
              "give",
              "express \"I called to present my warmest compliments\""
            ]
          },
          {
            "definition": "formally deliver (a check or bill) for acceptance or payment.",
            "examples": [
              "a check presented by Mr. Jackson was returned by the bank"
            ]
          },
          {
            "definition": "bring (a complaint, petition, or evidence) formally to the notice of a court."
          },
          {
            "definition": "(of a company or producer) put (a show or exhibition) before the public.",
            "examples": [
              "demonstrate, show, put on show/display, exhibit, display, launch, unveil More\"they presented their new product last month\"stage, put on, produce, perform \"presenting good quality opera\"Morethey presented their new product last monthstage, put on, produce, perform presenting good quality opera"
            ]
          },
          {
            "definition": "bring about or be the cause of (a problem or difficulty).",
            "examples": [
              "this should not present much difficulty"
            ]
          },
          {
            "definition": "exhibit (a particular state or appearance) to others.",
            "examples": [
              "the EC presented a united front over the crisis"
            ]
          },
          {
            "definition": "represent (someone) to others in a particular way, typically one that is false or exaggerated.",
            "examples": [
              "he presented himself as a hardworking man"
            ],
            "synonyms": [
              "represent",
              "describe",
              "portray",
              "depict \"the authorities present him as a common criminal\""
            ]
          },
          {
            "definition": "come forward into the presence of another or others, especially for a formal occasion; appear.",
            "examples": [
              "he failed to present himself in court"
            ]
          },
          {
            "definition": "(of an opportunity or idea) occur and be available for use or exploitation.",
            "examples": [
              "when a favorable opportunity presented itself, he would submit his proposition"
            ]
          },
          {
            "definition": "(of a patient) come forward for or undergo initial medical examination for a particular condition or symptom.",
            "examples": [
              "the patient presented with mild clinical encephalopathy"
            ]
          },
          {
            "definition": "(of a part of a fetus) be directed toward the cervix during labor."
          },
          {
            "definition": "(of an illness) manifest itself."
          },
          {
            "definition": "hold out or aim (a firearm) at something so as to be ready to fire.",
            "examples": [
              "they were to present their rifles, take aim, and fire"
            ]
          }
        ]
      }
    ]
  }
]