[
  {
    "word": "reach",
    "syllables": [
      "reach"
    ],
    "pronunciation": "rēCH",
    "parts": [
      {
        "part": "verb",
        "variants": [
          {
            "part": "gerund or present participle",
            "variant": "reaching"
          }
        ],
        "definitions": [
          {
            "definition": "stretch out an arm in a specified direction in order to touch or grasp something.",
            "examples": [
              "he reached over and turned off his bedside light"
            ],
            "synonyms": [
              "stretch out",
              "hold out",
              "extend",
              "outstretch",
              "thrust out",
              "stick out \"Travis reached out a hand\""
            ]
          },
          {
            "definition": "make a movement with one's hand or arm in an attempt to touch or grasp (something).",
            "examples": [
              "Carl reached for the phone"
            ]
          },
          {
            "definition": "stretch out one's hand or arm.",
            "examples": [
              "he reached out a hand and touched her forehead"
            ]
          },
          {
            "definition": "hand (something) to (someone).",
            "examples": [
              "reach me those glasses"
            ],
            "synonyms": [
              "pass",
              "hand",
              "give",
              "let someone have \"reach me that book\""
            ]
          },
          {
            "definition": "be able to touch something with an outstretched arm or leg.",
            "examples": [
              "I had to stand on tiptoe and even then I could hardly reach"
            ]
          },
          {
            "definition": "arrive at; get as far as.",
            "examples": [
              "“Goodbye,” she said as they reached the door"
            ],
            "synonyms": [
              "arrive at",
              "get to",
              "come to; Moreend up at; informalmake \"soon she reached Helen's house\""
            ]
          },
          {
            "definition": "attain or extend to (a specified point, level, or condition).",
            "examples": [
              "unemployment reached a peak in 1933"
            ],
            "synonyms": [
              "attain",
              "get to; Morerise to",
              "climb to; fall to",
              "sink to",
              "drop to; informalhit \"the temperature reached 32 degrees\""
            ]
          },
          {
            "definition": "succeed in achieving.",
            "examples": [
              "the intergovernmental conference reached agreement on the draft treaty"
            ],
            "synonyms": [
              "achieve",
              "attain",
              "work out",
              "draw up",
              "put together",
              "negotiate",
              "thrash out",
              "hammer out \"the leaders reached an agreement\""
            ]
          },
          {
            "definition": "make contact or communicate with (someone) by telephone or other means.",
            "examples": [
              "I've been trying to reach you all morning"
            ],
            "synonyms": [
              "get in touch with",
              "contact",
              "get through to",
              "get",
              "speak to; informalget hold of \"I have been trying to reach you all day\""
            ]
          },
          {
            "definition": "(of a broadcast or other communication) be received by.",
            "examples": [
              "television reached those parts of the electorate that other news sources could not"
            ]
          },
          {
            "definition": "succeed in influencing or having an effect on.",
            "examples": [
              "their fresh sound and message reach people who may never set foot in a church"
            ],
            "synonyms": [
              "influence",
              "sway",
              "get (through) to",
              "make an impression on",
              "have an impact on \"our concern is to reach more people\""
            ]
          },
          {
            "definition": "seek to establish communication with someone, with the aim of offering or obtaining assistance or cooperation.",
            "examples": [
              "his style was to reach out all the time, especially to members of his own party"
            ]
          },
          {
            "definition": "sail with the wind blowing from the side, or from slightly behind the side, of the ship."
          }
        ]
      }
    ]
  }
]