[
  {
    "word": "representative",
    "syllables": [
      "rep",
      "re",
      "sen",
      "ta",
      "tive"
    ],
    "pronunciation": "ˌreprəˈzen(t)ədiv",
    "parts": [
      {
        "part": "adjective",
        "variants": [
          {
            "part": "adjective",
            "variant": "representative"
          }
        ],
        "definitions": [
          {
            "definition": "typical of a class, group, or body of opinion.",
            "examples": [
              "these courses are representative of those taken by most Harvard undergraduates"
            ],
            "synonyms": [
              "typical",
              "prototypical",
              "characteristic",
              "illustrative",
              "archetypal \"a representative sample\""
            ],
            "antonyms": [
              "atypical"
            ]
          },
          {
            "definition": "containing typical examples of many or all types.",
            "examples": [
              "a representative sample of young people in the South"
            ]
          },
          {
            "definition": "(of a legislative or deliberative assembly) consisting of people chosen to act and speak on behalf of a wider group."
          },
          {
            "definition": "(of a government or political system) based on elected representatives.",
            "examples": [
              "free elections and representative democracy"
            ],
            "synonyms": [
              "elected",
              "elective",
              "chosen",
              "democratic",
              "popular \"representative government\""
            ],
            "antonyms": [
              "totalitarian"
            ]
          },
          {
            "definition": "serving as a portrayal or symbol of something.",
            "examples": [
              "the show should be more representative of how women really are"
            ],
            "synonyms": [
              "symbolic",
              "emblematic",
              "evocative \"the red maple leaf is representative of Canada\""
            ]
          },
          {
            "definition": "(of art) representational.",
            "examples": [
              "the bust involves a high degree of representative abstraction"
            ]
          },
          {
            "definition": "of or relating to mental representation."
          }
        ]
      },
      {
        "part": "noun",
        "variants": [
          {
            "part": "noun",
            "variant": "representative"
          },
          {
            "part": "plural noun",
            "variant": "representatives"
          }
        ],
        "definitions": [
          {
            "definition": "a person chosen or appointed to act or speak for another or others, in particular.",
            "examples": [
              "spokesperson, spokesman, spokeswoman, agent, official, mouthpiece a representative of the medical profession"
            ]
          },
          {
            "definition": "an agent of a firm who travels to potential clients to sell its products.",
            "examples": [
              "salesperson, salesman, saleswoman, agent; rep one of our representatives will show you our new line of pop-up books"
            ]
          },
          {
            "definition": "an employee of a travel company who looks after the needs of its vacationing clients."
          },
          {
            "definition": "a person chosen or elected to speak and act on behalf of others in a legislative assembly or deliberative body.",
            "examples": [
              "legislator, lawmaker; Moresenator, congressman, congresswoman, member of Congress, alderman, alderwoman, alderperson, selectman, selectwoman, lawmaker; voice \"contact your representatives and urge them to protect our wetlands\"Moresenator, congressman, congresswoman, member of Congress, alderman, alderwoman, alderperson, selectman, selectwoman, lawmaker; voice contact your representatives and urge them to protect our wetlands"
            ]
          },
          {
            "definition": "a delegate who attends a conference, negotiations, legal hearing, etc., so as to represent the interests of another person or group.",
            "examples": [
              "delegate, commissioner, ambassador, attaché, envoy, emissary, chargé d'affaires, deputy the Cambodian representative at the UN"
            ]
          },
          {
            "definition": "a person who takes the place of another on a ceremonial or official occasion.",
            "examples": [
              "deputy, substitute, stand-in, proxy he acted as his father's representative"
            ]
          },
          {
            "definition": "an example of a class or group.",
            "examples": [
              "fossil representatives of lampreys and hagfishes"
            ],
            "synonyms": [
              "example",
              "specimen",
              "exemplar",
              "exemplification \"fossil representatives of lampreys\""
            ]
          }
        ]
      }
    ]
  }
]