[
  {
    "word": "stick",
    "syllables": [
      "stick"
    ],
    "pronunciation": "stik",
    "parts": [
      {
        "part": "verb",
        "variants": [
          {
            "part": "gerund or present participle",
            "variant": "sticking"
          }
        ],
        "definitions": [
          {
            "definition": "push a sharp or pointed object into or through (something).",
            "examples": [
              "he stuck his fork into the sausage"
            ],
            "synonyms": [
              "thrust",
              "push",
              "insert",
              "jab",
              "poke",
              "dig",
              "plunge \"he stuck his fork into the sausage\""
            ]
          },
          {
            "definition": "fix something on (a point or pointed object).",
            "examples": [
              "stick the balls of wool on knitting needles"
            ]
          },
          {
            "definition": "(of a pointed object) be or remain fixed with its point embedded in (something).",
            "examples": [
              "there was a slim rod sticking into the ground beside me"
            ]
          },
          {
            "definition": "insert, thrust, or push.",
            "examples": [
              "past tense: sticked; past participle: sticked"
            ]
          },
          {
            "definition": "protrude or extend in a certain direction.",
            "examples": [
              "his front teeth stick out"
            ],
            "synonyms": [
              "be noticeable",
              "be visible",
              "be obvious",
              "be conspicuous",
              "stand out",
              "be obtrusive",
              "be prominent",
              "attract attention",
              "catch the eye",
              "leap out",
              "show up; informalstick/stand out like a sore thumb \"they stuck out in their strange clothes\""
            ]
          },
          {
            "definition": "put somewhere, typically in a quick or careless way.",
            "examples": [
              "just stick that sandwich on my desk"
            ],
            "synonyms": [
              "put (down)",
              "place",
              "set (down)",
              "lay (down)",
              "deposit",
              "position; Moreleave",
              "stow; informaldump",
              "park",
              "pop",
              "plunk \"just stick that sandwich on my desk\""
            ]
          },
          {
            "definition": "used to express angry dismissal of a particular thing.",
            "examples": [
              "he told them they could stick the job—he didn't want it anyway"
            ]
          },
          {
            "definition": "cause to incur an expense or loss.",
            "examples": [
              "she stuck me for all of last month's rent"
            ]
          },
          {
            "definition": "stab or pierce with a sharp object.",
            "examples": [
              "he screamed like a stuck pig"
            ],
            "synonyms": [
              "pierce",
              "penetrate",
              "puncture",
              "prick",
              "stab \"the bristles stuck into her skin\""
            ]
          },
          {
            "definition": "adhere or cling to a substance or surface.",
            "examples": [
              "the plastic seats stuck to my skin"
            ],
            "synonyms": [
              "adhere",
              "cling",
              "be fixed",
              "be glued \"the cup stuck to its saucer\""
            ]
          },
          {
            "definition": "fasten or cause to adhere to an object or surface.",
            "examples": [
              "she stuck the stamp on the envelope"
            ],
            "synonyms": [
              "affix",
              "attach",
              "fasten",
              "fix; Morepaste",
              "glue",
              "gum",
              "tape",
              "Scotch-tape",
              "pin",
              "tack \"stick the stamp there\""
            ]
          },
          {
            "definition": "be or become fixed or jammed in one place as a result of an obstruction.",
            "examples": [
              "he drove into a bog, where his wheels stuck fast"
            ],
            "synonyms": [
              "become trapped",
              "become jammed",
              "jam",
              "catch",
              "become wedged",
              "become lodged",
              "become fixed",
              "become embedded \"the wheels stuck in the mud\""
            ]
          },
          {
            "definition": "remain in a static condition; fail to progress.",
            "examples": [
              "he lost a lot of weight but had stuck at 210 pounds"
            ]
          },
          {
            "definition": "be or become convincing, established, or regarded as valid.",
            "examples": [
              "the authorities couldn't make the charges stick"
            ],
            "synonyms": [
              "remain",
              "stay",
              "linger",
              "dwell",
              "persist",
              "continue",
              "last",
              "endure",
              "burn More\"that sticks in his mind\"be upheld",
              "hold",
              "be believed; informalhold water \"the charges won't stick\""
            ]
          },
          {
            "definition": "(in blackjack and similar card games) decline to add to one's hand."
          },
          {
            "definition": "be fixed in a particular position or unable to move or be moved.",
            "examples": [
              "Sara tried to open the window but it was stuck"
            ]
          },
          {
            "definition": "be unable to progress with a task or find the answer or solution to something.",
            "examples": [
              "I'm doing the crossword and I'm stuck"
            ]
          },
          {
            "definition": "be or remain in a specified place or situation, typically one perceived as tedious or unpleasant.",
            "examples": [
              "I don't want to be stuck in an office all my life"
            ]
          },
          {
            "definition": "be at a loss for or in need of.",
            "examples": [
              "I'm not usually stuck for words"
            ]
          },
          {
            "definition": "be unable to get rid of or escape from.",
            "examples": [
              "like it or not, she and Grant were stuck with each other"
            ],
            "synonyms": [
              "lumbered with",
              "left with",
              "made responsible for \"she's always getting stuck with the neighbors' kids\""
            ]
          },
          {
            "definition": "be infatuated with.",
            "examples": [
              "he's too good for Jenny, even though she's so stuck on him"
            ],
            "synonyms": [
              "infatuated with",
              "besotted with",
              "smitten with",
              "(head over heels) in love with",
              "obsessed with; Moreinformalcrazy about",
              "mad about",
              "wild about",
              "carrying a torch for \"no one knew that Kit was stuck on his brother's wife\""
            ]
          },
          {
            "definition": "accept or tolerate (an unpleasant or unwelcome person or situation).",
            "examples": [
              "I can't stick Geoffrey—he's a real old misery"
            ]
          },
          {
            "definition": "put up with or persevere with something difficult or disagreeable.",
            "examples": [
              "put up with it, grin and bear it, keep at it, keep going, stay with it, see it through; Morepersevere, persist, carry on, struggle on; informalhang in there, soldier on, tough it out, nail one's colors to the mast \"I think I can stick it out for another two weeks\"Morepersevere, persist, carry on, struggle on; hang in there, soldier on, tough it out, nail one's colors to the mast I think I can stick it out for another two weeks"
            ]
          }
        ]
      }
    ]
  }
]